In [1]:
import numpy as np
import pandas as pd

In [2]:
t=[3,4,5,"hello"] # S should be in caps
s=pd.Series(t)
s

0        3
1        4
2        5
3    hello
dtype: object

In [3]:
type(s)

pandas.core.series.Series

In [4]:
#import csv to python jupyter notebook

In [5]:
name_of_pdf=pd.read_csv(r'C:\data set/occupation.csv')
name_of_pdf

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator     2215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [6]:
s1 = pd.Series([3,5,7],index=['a','b','c'])
s2 = pd.Series([8,2,3],index=['a','b','c'])
print(s1)
print(s2)

a    3
b    5
c    7
dtype: int64
a    8
b    2
c    3
dtype: int64

In [7]:
##array is multi dimensional, homogenous data whereas series is one dimensional heterogenous data

In [8]:
s1+s2

a    11
b     7
c    10
dtype: int64

In [9]:
s1 = pd.Series([3,5,7],index=['a','b','c'])
s2 = pd.Series([8,2,3],index=['a','b','d'])     # nan is not a number
s1+s2

a    11.0
b     7.0
c     NaN
d     NaN
dtype: float64

In [10]:
df = pd.DataFrame(data=[[2,3,4,5],[3,4,5,6],[2,6,7,5]],columns=['c1','c2','c3','c4'])
df

   c1  c2  c3  c4
0   2   3   4   5
1   3   4   5   6
2   2   6   7   5

In [11]:
df1 = pd.DataFrame(data=[[2,3,4,5],[3,4,5,6],[2,6,7,5]])
df1

   0  1  2  3
0  2  3  4  5
1  3  4  5  6
2  2  6  7  5

In [12]:
df2 = pd.DataFrame(data=[[2,3,4,5],[3,4,5,6],[2,6,7,5]],columns=['c1','c2','c3','c4'],index=['r1','r2','r3'])
df2

    c1  c2  c3  c4
r1   2   3   4   5
r2   3   4   5   6
r3   2   6   7   5

In [13]:
print(pd.Series([2,3,45])) #using list
print(pd.Series((22,31,45))) #using tuple
print(pd.Series({'a1':12,'a2':34,'a3':34})) #using dict
print(np.array([1,2,3,4])) #using numpy array

0     2
1     3
2    45
dtype: int64
0    22
1    31
2    45
dtype: int64
a1    12
a2    34
a3    34
dtype: int64
[1 2 3 4]

In [14]:
pd.Series(3,index=[0,1,2,3])

0    3
1    3
2    3
3    3
dtype: int64

In [15]:
# accessing data from series
x = pd.Series([23,3,4,56,34,54],index=list('abcdef'))
x

a    23
b     3
c     4
d    56
e    34
f    54
dtype: int64

In [16]:
x['d']  #label based indexing

56

In [17]:
x[['e','f','a']]

e    34
f    54
a    23
dtype: int64

In [18]:
 x

a    23
b     3
c     4
d    56
e    34
f    54
dtype: int64

In [19]:
x[1:4] #4 isexcluded

b     3
c     4
d    56
dtype: int64

In [20]:
x['c':'f']  #f is included

c     4
d    56
e    34
f    54
dtype: int64

In [21]:
x1 = pd.Series(np.random.randint(0,50,50))
x1

0      5
1      7
2     45
3     23
4     35
5     15
6      4
7     49
8     36
9      7
10    40
11    42
12     0
13    10
14    20
15     4
16     4
17    10
18    30
19    18
20    34
21    37
22    34
23    28
24    33
25    41
26    41
27     6
28    16
29     7
30    31
31     8
32    45
33    17
34    16
35    30
36     3
37    46
38    26
39    34
40     9
41    36
42    15
43    45
44     5
45    28
46    45
47     4
48    19
49    48
dtype: int32

In [22]:
x1.head()   # displays top 5 series

0     5
1     7
2    45
3    23
4    35
dtype: int32

In [23]:
x1.tail()

45    28
46    45
47     4
48    19
49    48
dtype: int32

In [24]:
veg = pd.Series({'tomato':10,'potato':23,'chilly':3,'pumpkin':2,'onion':12,'brinjal':20,'beans':60})
veg

tomato     10
potato     23
chilly      3
pumpkin     2
onion      12
brinjal    20
beans      60
dtype: int64

In [25]:
print(veg[0])
print(veg["tomato"])

10
10

In [26]:
print(veg.iloc[0])   #just like address is loc or location and pincode is iloc or index location
print(veg.loc["tomato"])

10
10

In [27]:
print(veg[0]) #position based iloc.
print(veg['tomato']) #label based loc.

10
10

In [28]:
#cutted so many codes try to get it

In [29]:
# unique, nunique, value_counts
l2 = ['female','male','male','male','female','female']
new_l2 = pd.Series(l2)
new_l2

0    female
1      male
2      male
3      male
4    female
5    female
dtype: object

In [30]:
new_l2.unique()

array(['female', 'male'], dtype=object)

In [31]:
new_l2.nunique()

2

In [32]:
new_l2.value_counts()

female    3
male      3
dtype: int64

In [33]:
a1 = pd.Series(list('abcde'*4))
a1

0     a
1     b
2     c
3     d
4     e
5     a
6     b
7     c
8     d
9     e
10    a
11    b
12    c
13    d
14    e
15    a
16    b
17    c
18    d
19    e
dtype: object

In [34]:
a1.unique()

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [35]:
a1.nunique()

5

In [36]:
a1.value_counts()

e    4
a    4
d    4
b    4
c    4
dtype: int64

In [37]:
x2 = pd.Series(np.random.randint(10,40,10),index=list('abcdefjgij'))
x2

a    23
b    36
c    14
d    16
e    33
f    13
j    13
g    29
i    30
j    30
dtype: int32

In [38]:
print(df1['c1']) #extract colun
print(df1.loc[:,'c1'])
print(df1.c1)
print(df1.iloc[:,0])

KeyError: 'c1'

In [39]:
l1=[3,'hello','python']
for i in enumerate(l1):
    print(i)

(0, 3)
(1, 'hello')
(2, 'python')

In [40]:
d={'a1':'apple','a2':"banana",'a3':'pomo'}
d

{'a1': 'apple', 'a2': 'banana', 'a3': 'pomo'}

In [41]:
l1

[3, 'hello', 'python']

In [42]:
pd.Series(l1,index=[1,2,3])

1         3
2     hello
3    python
dtype: object

In [43]:
s1=pd.Series([3,6,9],index=['e','f','g'])
s2=pd.Series([1,2,1,5],index=['n','o','p','q'])
print(s1)
print(s2)

e    3
f    6
g    9
dtype: int64
n    1
o    2
p    1
q    5
dtype: int64

In [44]:
s1+s2

e   NaN
f   NaN
g   NaN
n   NaN
o   NaN
p   NaN
q   NaN
dtype: float64

In [45]:
df=pd.DataFrame(data=[[4,5,6,7],[2,3,4,5],[9,8,7,6],[4,5,6,7]],columns=['c1','c2','c3','c4'])
df

   c1  c2  c3  c4
0   4   5   6   7
1   2   3   4   5
2   9   8   7   6
3   4   5   6   7

In [46]:
df5=pd.DataFrame(data=[[4,5,6,7],[2,3,4,5],[9,8,7,6],[4,5,6,7]],index=['c1','c2','c3','c4'])
df5

    0  1  2  3
c1  4  5  6  7
c2  2  3  4  5
c3  9  8  7  6
c4  4  5  6  7

In [47]:
df6=pd.DataFrame(data=[[4,5,6,7],[2,3,4,5],[9,8,7,6],[4,5,6,7]])
df6

   0  1  2  3
0  4  5  6  7
1  2  3  4  5
2  9  8  7  6
3  4  5  6  7

In [48]:
df7=pd.DataFrame(data=[[4,5,6,7],[2,3,4,5],[9,8,7,6],[4,5,6,7]],columns=['c1','c2','c3','c4'],index=['r1','r2','r3','r4'])
df7

    c1  c2  c3  c4
r1   4   5   6   7
r2   2   3   4   5
r3   9   8   7   6
r4   4   5   6   7

In [49]:
print(pd.Series([2,3,4]))  #list
print(pd.Series((5,6,7)))   #tuples
print(pd.Series({'n1':9,'n2':6,'n3':4}))  #dictonary
print(np.array([3,5,8])) # numpy array

0    2
1    3
2    4
dtype: int64
0    5
1    6
2    7
dtype: int64
n1    9
n2    6
n3    4
dtype: int64
[3 5 8]

In [50]:
pd.Series(2)

0    2
dtype: int64

In [51]:
pd.Series(2,index=[3,4,5,6])

3    2
4    2
5    2
6    2
dtype: int64

In [52]:
i=pd.Series([12,13,14,15,16,17,18],index=list('abcdefg'))
i

a    12
b    13
c    14
d    15
e    16
f    17
g    18
dtype: int64

In [53]:
i[3] #position based indexing

15

In [54]:
i['d']  # label based indexing

15

In [55]:
print(i[2])
print(i['c'])

14
14

In [56]:
print(i[1:2])    # 2 is excluded
print(i['b':'d'])   # d is included

b    13
dtype: int64
b    13
c    14
d    15
dtype: int64

In [57]:
i

a    12
b    13
c    14
d    15
e    16
f    17
g    18
dtype: int64

In [58]:
i[[1,3,5]]
i[1::2]

b    13
d    15
f    17
dtype: int64

In [59]:
i[[4,5,0]]

e    16
f    17
a    12
dtype: int64

In [60]:
i[['e','f','a']]  #if u neeed random index part use double paranthesis i.e [[..]]

e    16
f    17
a    12
dtype: int64

In [61]:
i[::3]

a    12
d    15
g    18
dtype: int64

In [62]:
i.values

array([12, 13, 14, 15, 16, 17, 18], dtype=int64)

In [63]:
i.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [64]:
i.nbytes

56

In [65]:
i.shape

(7,)

In [66]:
len(i)

7

In [67]:
i1=pd.Series(np.random.randint(0,9,10),index=list('abcdefghij'))
i1

a    2
b    7
c    6
d    8
e    6
f    6
g    8
h    0
i    7
j    0
dtype: int32

In [68]:
i1.head()

a    2
b    7
c    6
d    8
e    6
dtype: int32

In [69]:
i1.tail()

f    6
g    8
h    0
i    7
j    0
dtype: int32

In [70]:
i1.head(7)

a    2
b    7
c    6
d    8
e    6
f    6
g    8
dtype: int32

In [71]:
i1.tail(3)

h    0
i    7
j    0
dtype: int32

In [72]:
veg=pd.Series({'tomato':'t','beetroot':'b','carrot':'c','potato':'p','onion':'o'})
veg

tomato      t
beetroot    b
carrot      c
potato      p
onion       o
dtype: object

In [73]:
print(veg[0])  # position based loc

t

In [74]:
print(veg['tomato'])  #label based iloc

t

In [75]:
veg.iloc[0]
veg.loc['tomato']

't'

In [76]:
veg

tomato      t
beetroot    b
carrot      c
potato      p
onion       o
dtype: object

In [77]:
veg1=pd.Series({'tomato':4,'beetroot':8,'carrot':12,'potato':16,'onion':20})
veg1

tomato       4
beetroot     8
carrot      12
potato      16
onion       20
dtype: int64

In [78]:
veg1>=8

tomato      False
beetroot     True
carrot       True
potato       True
onion        True
dtype: bool

In [79]:
veg1[veg1<10]

tomato      4
beetroot    8
dtype: int64

In [80]:
veg1.isin([12]) #isin only for values

tomato      False
beetroot    False
carrot       True
potato      False
onion       False
dtype: bool

In [81]:
veg1[veg1.isin([12])]

carrot    12
dtype: int64

In [82]:
a1 = pd.Series(list('abcde'*4))
a1

0     a
1     b
2     c
3     d
4     e
5     a
6     b
7     c
8     d
9     e
10    a
11    b
12    c
13    d
14    e
15    a
16    b
17    c
18    d
19    e
dtype: object

In [83]:
a1.value_counts()

e    4
a    4
d    4
b    4
c    4
dtype: int64

In [84]:
a1.duplicated()

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
dtype: bool

In [85]:
 a1[a1.duplicated()]

5     a
6     b
7     c
8     d
9     e
10    a
11    b
12    c
13    d
14    e
15    a
16    b
17    c
18    d
19    e
dtype: object

In [86]:
a1.drop_duplicates()

0    a
1    b
2    c
3    d
4    e
dtype: object

In [87]:
y1=pd.Series(np.random.randint(2,10,9),index=list('abcdefghi'))
y1

a    3
b    3
c    5
d    9
e    9
f    3
g    5
h    9
i    7
dtype: int32

In [88]:
y1.idxmax()

'd'

In [89]:
y1.idxmin()

'a'

In [90]:
y1.nlargest()

d    9
e    9
h    9
i    7
c    5
dtype: int32

In [91]:
y1.nlargest(3)

d    9
e    9
h    9
dtype: int32

In [92]:
y1.nsmallest()

a    3
b    3
f    3
c    5
g    5
dtype: int32

In [93]:
y1

a    3
b    3
c    5
d    9
e    9
f    3
g    5
h    9
i    7
dtype: int32

In [94]:
y1.sort_values()

a    3
b    3
f    3
c    5
g    5
i    7
d    9
e    9
h    9
dtype: int32

In [95]:
y1.sort_index()

a    3
b    3
c    5
d    9
e    9
f    3
g    5
h    9
i    7
dtype: int32

In [96]:
j=pd.Series(np.random.randn(20).round(2))
j

0    -0.25
1    -0.93
2     0.61
3     0.24
4     0.60
5    -0.18
6     0.36
7    -0.44
8     0.80
9     1.68
10   -0.92
11   -0.97
12   -2.45
13    0.82
14    0.27
15    0.69
16   -0.71
17    0.53
18   -0.05
19    0.94
dtype: float64

In [97]:
j.mean()

0.03199999999999999

In [98]:
j.std()

0.9232927345561702

In [99]:
j.var()

0.8524694736842107

In [100]:
j.median()

0.255

In [101]:
j.describe()

count    20.000000
mean      0.032000
std       0.923293
min      -2.450000
25%      -0.507500
50%       0.255000
75%       0.630000
max       1.680000
dtype: float64

In [102]:
j.mode()

0    -2.45
1    -0.97
2    -0.93
3    -0.92
4    -0.71
5    -0.44
6    -0.25
7    -0.18
8    -0.05
9     0.24
10    0.27
11    0.36
12    0.53
13    0.60
14    0.61
15    0.69
16    0.80
17    0.82
18    0.94
19    1.68
dtype: float64

In [103]:
k=pd.Series([3,4,5,np.nan,8,9,np.nan,9])
k

0    3.0
1    4.0
2    5.0
3    NaN
4    8.0
5    9.0
6    NaN
7    9.0
dtype: float64

In [104]:
k.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
dtype: bool

In [105]:
k[k.isnull()]

3   NaN
6   NaN
dtype: float64

In [106]:
k.notnull()

0     True
1     True
2     True
3    False
4     True
5     True
6    False
7     True
dtype: bool

In [107]:
k[k.notnull()]

0    3.0
1    4.0
2    5.0
4    8.0
5    9.0
7    9.0
dtype: float64

In [108]:
k

0    3.0
1    4.0
2    5.0
3    NaN
4    8.0
5    9.0
6    NaN
7    9.0
dtype: float64

In [109]:
k.ffill()

0    3.0
1    4.0
2    5.0
3    5.0
4    8.0
5    9.0
6    9.0
7    9.0
dtype: float64

In [110]:
b=['biriyani','mutta','karuavdu',np.nan,'sambar','mutta','biriyani']
b

['biriyani', 'mutta', 'karuavdu', nan, 'sambar', 'mutta', 'biriyani']

In [111]:
b.ffill()

AttributeError: 'list' object has no attribute 'ffill'

In [112]:
k

0    3.0
1    4.0
2    5.0
3    NaN
4    8.0
5    9.0
6    NaN
7    9.0
dtype: float64

In [113]:
k.fillna(1)

0    3.0
1    4.0
2    5.0
3    1.0
4    8.0
5    9.0
6    1.0
7    9.0
dtype: float64

In [114]:
k.fillna(k.mean())

0    3.000000
1    4.000000
2    5.000000
3    6.333333
4    8.000000
5    9.000000
6    6.333333
7    9.000000
dtype: float64

In [115]:
k.mean()

6.333333333333333

In [116]:
k.fillna(k.mode())

0    3.0
1    4.0
2    5.0
3    NaN
4    8.0
5    9.0
6    NaN
7    9.0
dtype: float64

In [117]:
k.mode()

0    9.0
dtype: float64

In [118]:
k.dropna()

0    3.0
1    4.0
2    5.0
4    8.0
5    9.0
7    9.0
dtype: float64

In [119]:
df2 = pd.DataFrame(data=[[2,3,4,5],[3,4,5,6],[2,6,7,5]],columns=['c1','c2','c3','c4'],index=['r1','r2','r3'])
df2

    c1  c2  c3  c4
r1   2   3   4   5
r2   3   4   5   6
r3   2   6   7   5

In [120]:
df5 = pd.DataFrame([[np.nan,3,4,np.nan],[np.nan,3,5,4],[np.nan,34,2,4],[np.nan,45,34,np.nan]],columns=list('ABCD'))
df5

    A   B   C    D
0 NaN   3   4  NaN
1 NaN   3   5  4.0
2 NaN  34   2  4.0
3 NaN  45  34  NaN

In [121]:
dq = pd.DataFrame(data=[[2,3,4,5,'hello'],[3,4,5,6,'hi'],[2,6,7,5,'hi']],columns=['c1','c2','c3','c4','c5'],index=['r1','r2','r3'])
dq

    c1  c2  c3  c4     c5
r1   2   3   4   5  hello
r2   3   4   5   6     hi
r3   2   6   7   5     hi

In [122]:
dq.describe(include='all')

              c1        c2        c3        c4   c5
count   3.000000  3.000000  3.000000  3.000000    3
unique       NaN       NaN       NaN       NaN    2
top          NaN       NaN       NaN       NaN   hi
freq         NaN       NaN       NaN       NaN    2
mean    2.333333  4.333333  5.333333  5.333333  NaN
std     0.577350  1.527525  1.527525  0.577350  NaN
min     2.000000  3.000000  4.000000  5.000000  NaN
25%     2.000000  3.500000  4.500000  5.000000  NaN
50%     2.000000  4.000000  5.000000  5.000000  NaN
75%     2.500000  5.000000  6.000000  5.500000  NaN
max     3.000000  6.000000  7.000000  6.000000  NaN

In [123]:
year_df = pd.DataFrame({'start_year':[2001,2002,2005,2008,2006],
             'end_year':[2002,2010,2008,2006,2014]})
year_df

   start_year  end_year
0        2001      2002
1        2002      2010
2        2005      2008
3        2008      2006
4        2006      2014

In [124]:
dq = pd.DataFrame(data=[[2,3,4,5,'hello'],[3,4,5,6,'hi'],[2,6,7,5,'hi']],columns=['c1','c2','c3','c4','c5'],index=['r1','r2','r3'])
dq

    c1  c2  c3  c4     c5
r1   2   3   4   5  hello
r2   3   4   5   6     hi
r3   2   6   7   5     hi

In [125]:
dq.head()

    c1  c2  c3  c4     c5
r1   2   3   4   5  hello
r2   3   4   5   6     hi
r3   2   6   7   5     hi

In [126]:
df2 = pd.DataFrame(data=[[2,3,4,5],[3,4,5,6],[2,6,7,5]],columns=['c1','c2','c3','c4'],index=['r1','r2','r3'])
df2

    c1  c2  c3  c4
r1   2   3   4   5
r2   3   4   5   6
r3   2   6   7   5

In [127]:
df2.head(1)

    c1  c2  c3  c4
r1   2   3   4   5

In [128]:
df2.tail(2)

    c1  c2  c3  c4
r2   3   4   5   6
r3   2   6   7   5

In [129]:
type(df2)

pandas.core.frame.DataFrame

In [130]:
df2

    c1  c2  c3  c4
r1   2   3   4   5
r2   3   4   5   6
r3   2   6   7   5

In [131]:
df2.iloc[1,:2]

c1    3
c2    4
Name: r2, dtype: int64

In [132]:
df2.loc['r1','c2']

3

In [133]:
df2['c1']

r1    2
r2    3
r3    2
Name: c1, dtype: int64

In [134]:
df2.iloc[:,1:3]

    c2  c3
r1   3   4
r2   4   5
r3   6   7

In [135]:
df2.loc[:,'c2':'c3']

    c2  c3
r1   3   4
r2   4   5
r3   6   7

In [136]:
df2.loc[:,['c1','c4','c2']]

    c1  c4  c2
r1   2   5   3
r2   3   6   4
r3   2   5   6

In [137]:
df2['c5']=[2,3,4]
df2

    c1  c2  c3  c4  c5
r1   2   3   4   5   2
r2   3   4   5   6   3
r3   2   6   7   5   4

In [138]:
df2.del['r4']
df2

SyntaxError: invalid syntax (<ipython-input-138-d85a81dff114>, line 1)

In [139]:
dt=[2,3,4,5,6,7]
dt1=pd.DataFrame(dt,columns=['c1'],index=['r1','r2','r3','r4','r5','r6'])
dt1

    c1
r1   2
r2   3
r3   4
r4   5
r5   6
r6   7

In [140]:
dt3={'name':['priya','vino','vara','kumu'],'age':[22,26,59,49]}
dt4=pd.DataFrame(dt3,index=['r1','r2','r3','r4'])
dt4

     name  age
r1  priya   22
r2   vino   26
r3   vara   59
r4   kumu   49

In [141]:
dt5=pd.DataFrame(np.arange(30,50).reshape(5,4),columns=list('abcd'),index=list('pqrst'))
dt5

    a   b   c   d
p  30  31  32  33
q  34  35  36  37
r  38  39  40  41
s  42  43  44  45
t  46  47  48  49

In [142]:
print(dt5.index)

Index(['p', 'q', 'r', 's', 't'], dtype='object')

In [143]:
print(dt5.columns)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [144]:
dt5

    a   b   c   d
p  30  31  32  33
q  34  35  36  37
r  38  39  40  41
s  42  43  44  45
t  46  47  48  49

In [145]:
dt5.loc[['p','s','q'],['c','d','a']]

    c   d   a
p  32  33  30
s  44  45  42
q  36  37  34

In [146]:
dt5.iloc[1:,2:]

    c   d
q  36  37
r  40  41
s  44  45
t  48  49

In [147]:
df5 = pd.DataFrame([[np.nan,3,4,np.nan],[np.nan,3,5,4],[np.nan,34,2,4],[np.nan,45,34,np.nan]],columns=list('ABCD'))
df5

    A   B   C    D
0 NaN   3   4  NaN
1 NaN   3   5  4.0
2 NaN  34   2  4.0
3 NaN  45  34  NaN

In [148]:
 df5.isnull().sum()

A    4
B    0
C    0
D    2
dtype: int64

In [149]:
df5.dropna(axis=0,how='any')
df5.dropna()    # axis=0 and how='any' is default i.e row

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [150]:
df5.dropna(axis=1)

    B   C
0   3   4
1   3   5
2  34   2
3  45  34

In [151]:
print(df5.dropna(axis=1,how='all'))
print(df5.dropna(axis=1,how='any'))

    B   C    D
0   3   4  NaN
1   3   5  4.0
2  34   2  4.0
3  45  34  NaN
    B   C
0   3   4
1   3   5
2  34   2
3  45  34

In [152]:
print(df5.dropna(axis=0,how='any'))
print(df5.dropna(axis=0,how='all'))

Empty DataFrame
Columns: [A, B, C, D]
Index: []
    A   B   C    D
0 NaN   3   4  NaN
1 NaN   3   5  4.0
2 NaN  34   2  4.0
3 NaN  45  34  NaN

In [153]:
df5.loc['A':'D'].dropna(how='all')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [154]:
df5.fillna(2)

     A   B   C    D
0  2.0   3   4  2.0
1  2.0   3   5  4.0
2  2.0  34   2  4.0
3  2.0  45  34  2.0